EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_qspi.h
/*************************************************************************************************************
 * @file    reg_qspi.h
 * @version V1.1
 * @date    2022-01-18
 * @brief   
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/


#ifndef __REG_QSPI_H__
#define __REG_QSPI_H__

#ifdef __cplusplus
extern "C" {
#endif


//=====================================================================================================================
// TYPEDEF STRUCT
//=====================================================================================================================
typedef struct
{
    __IM  uint32_t QSPI_RX_FIFO;                    /* [0x00](RO) */
    __OM  uint32_t QSPI_TX_FIFO;                    /* [0x04](WO) */
    __IM  uint32_t QSPI_INT_FLAG;                   /* [0x08](RO) */
    __IOM uint32_t QSPI_INT_EN;                     /* [0x0C](RW) */
    __OM  uint32_t QSPI_INT_CLR;                    /* [0x10](WO) */
    __IOM uint32_t QSPI_TXFIFO_THLD;                /* [0x14](RW) */
    __IOM uint32_t QSPI_RXFIFO_THLD;                /* [0x18](RW) */
    __IOM uint32_t QSPI_CLK_EN;                     /* [0x1C](RW) */
    __IOM uint32_t QSPI_EXT_CG_EN;                  /* [0x20](RW) */
    __IOM uint32_t QSPI_SCRAMBLE_EN;                /* [0x24](RW) */
    __IOM uint32_t QSPI_SCRAMBLE_KEY;               /* [0x28](RW) */
    __IOM uint32_t QSPI_CFG;                        /* [0x2C](RW) */
    __IOM uint32_t QSPI_DELAY_CFG;                  /* [0x30](RW) */
    __IOM uint32_t QSPI_MEM_OPI_CFG;                /* [0x34](RW) */
          uint32_t RESERVED0[2];                    /* [0x38~0x3C] */

    __IOM uint32_t QSPI_MEM_TX_CFG;                 /* [0x40](RW) */
    __IOM uint32_t QSPI_MEM_DATA_LEN;               /* [0x44](RW) */
    __IOM uint32_t QSPI_MEM_CMD;                    /* [0x48](RW) */
    __IOM uint32_t QSPI_MEM_ADDR;                   /* [0x4C](RW) */
    __IOM uint32_t QSPI_MEM_LEN_CFG;                /* [0x50](RW) */
    __IOM uint32_t QSPI_FLASH_BUSY;                 /* [0x54](RW) */
    __IOM uint32_t QSPI_FLASH_AUTO_BUSY_EN;         /* [0x58](RW) */
    __IOM uint32_t QSPI_FLASH_CHECK_BUSY_INTERVAL;  /* [0x5C](RW) */
    __IOM uint32_t QSPI_FLASH_CHECK_BUSY_CMD;       /* [0x60](RW) */
    __IOM uint32_t QSPI_FLASH_SUSPEND_CTRL;         /* [0x64](RW) */
    __OM  uint32_t QSPI_FLASH_SUSPEND_EN;           /* [0x68](WO) */
    __OM  uint32_t QSPI_FLASH_TX_EN;                /* [0x6C](WO) */
    __IM  uint32_t QSPI_FLASH_AUTO_BUSY_FLAG;       /* [0x70](RO) */
          uint32_t RESERVED1[3];                    /* [0x74~0x7C] */

    __IOM uint32_t QSPI_MEM_CACHE_CMD1;             /* [0x80](RW) */
    __IOM uint32_t QSPI_MEM_CACHE_CMD2;             /* [0x84](RW) */
    __IOM uint32_t QSPI_FLASH_CACHE_DELAY_CFG;      /* [0x88](RW) */
    __IOM uint32_t QSPI_MEM_CACHE_CFG;              /* [0x8C](RW) */
    __IOM uint32_t QSPI_FLASH_CONTINUE_READ_CFG;    /* [0x90](RW) */
    __IM  uint32_t QSPI_FLASH_CONTINUE_STATUS;      /* [0x94](RO) */
    __OM  uint32_t QSPI_FLASH_RESET_CFG;            /* [0x98](WO) */
    __IM  uint32_t QSPI_FLASH_RESET_STATUS;         /* [0x9C](RO) */
    __IM  uint32_t QSPI_FLASH_CACHE_ACCESS_STATUS;  /* [0xA0](RO) */
    __IM  uint32_t QSPI_MEM_STATUS;                 /* [0xA4](RO) */
          uint32_t RESERVED2[6];                    /* [0xA8~0xBC] */

    __IOM uint32_t QSPI_LCD_CFG;                    /* [0xC0](RW) */
    __IOM uint32_t QSPI_LCD_CTRL;                   /* [0xC4](RW) */
    __OM  uint32_t QSPI_LCD_RX_EN;                  /* [0xC8](WO) */
    __IM  uint32_t QSPI_LCD_TX_STATUS;              /* [0xCC](RO) */
    __IM  uint32_t QSPI_LCD_RX_STATUS;              /* [0xD0](RO) */
    __IOM uint32_t QSPI_HPM_BYPASS_CFG;             /* [0xD4](RW) */
    __IOM uint32_t QSPI_AUTOM_RSP_CFG;              /* [0xD8](RW) */
    __OM  uint32_t QSPI_HPM_CLR;                    /* [0xDC](WO) */

} stQSPI_Handle_t, *pstQSPI_Handle_t;

#define IS_VALID_FLASH_HANDLE(handle)    ((FLASH0) == (handle) || (FLASH1) == (handle))
#define IS_VALID_QSPI_HANDLE(handle)     ((QSPI0) == (handle) || (QSPI1) == (handle))


//=====================================================================================================================
// [0x08~0x10] QSPI_INT_FLAG / QSPI_INT_EN  / QSPI_INT_CLR
//=====================================================================================================================
#define QSPI_RX_FINISHED_SHIFT             (9)
#define QSPI_TX_FINISHED_SHIFT             (8)
#define QSPI_RXFIFO_UNDER_FLOW_SHIFT       (7)
#define QSPI_RXFIFO_OVER_THLD_SHIFT        (6)
#define QSPI_RXFIFO_FULL_SHIFT             (5)
#define QSPI_RXFIFO_NOT_EMPTY_SHIFT        (4)
#define QSPI_TXFIFO_OVER_FLOW_SHIFT        (3)
#define QSPI_TXFIFO_UNDER_THLD_SHIFT       (2)
#define QSPI_TXFIFO_FULL_SHIFT             (1)
#define QSPI_TXFIFO_EMPTY_SHIFT            (0)

