EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_qspi.h
typedef enum
{
    QSPI_INT_TXFIFO_EMPTY         = (0x01 << QSPI_TXFIFO_EMPTY_SHIFT),
    QSPI_INT_TXFIFO_FULL          = (0x01 << QSPI_TXFIFO_FULL_SHIFT),
    QSPI_INT_TXFIFO_UNDER_THLD    = (0x01 << QSPI_TXFIFO_UNDER_THLD_SHIFT),
    QSPI_INT_TXFIFO_OVER_FLOW     = (0x01 << QSPI_TXFIFO_OVER_FLOW_SHIFT),
    QSPI_INT_RXFIFO_NOT_EMPTY     = (0x01 << QSPI_RXFIFO_NOT_EMPTY_SHIFT),
    QSPI_INT_RXFIFO_FULL          = (0x01 << QSPI_RXFIFO_FULL_SHIFT),
    QSPI_INT_RXFIFO_OVER_THLD     = (0x01 << QSPI_RXFIFO_OVER_THLD_SHIFT),
    QSPI_INT_RXFIFO_UNDER_FLOW    = (0x01 << QSPI_RXFIFO_UNDER_FLOW_SHIFT),
    QSPI_INT_TX_FINISHED          = (0x01 << QSPI_TX_FINISHED_SHIFT),
    QSPI_INT_RX_FINISHED          = (0x01 << QSPI_RX_FINISHED_SHIFT),

} EN_QSPI_INT_FLAG_T;

#define QSPI_INT_MASK      (0x3FF)


//=====================================================================================================================
// [0x24](RW) QSPI_SCRAMBLE_EN
//=====================================================================================================================
//=============================================================================
// QSPI_SCRAMBLE_EN[1:0] QSPI_SCRAMBLE_EN Define
#define QSPI_SCRAMBLE_EN_SHIFT             (0)
#define QSPI_SCRAMBLE_EN_MSK               ((0x01 << 2) - 1)


//=====================================================================================================================
// [0x28](RW) QSPI_SCRAMBLE_KEY
//=====================================================================================================================
//=============================================================================
// QSPI_SCRAMBLE_KEY[31:0] QSPI_SCRAMBLE_KEY Define
#define QSPI_SCRAMBLE_KEY_SHIFT            (0)
#define QSPI_SCRAMBLE_KEY_MSK              (WORD_MSK)


//=====================================================================================================================
// [0x2C](RW) QSPI_CFG
//=====================================================================================================================
//=============================================================================
// QSPI_CFG[5] QSPI_SAMPLE_EDGE_SEL Define
#define QSPI_SAMPLE_EDGE_SEL_SHIFT         (5)
#define QSPI_SAMPLE_EDGE_SEL_MSK           ((0x01 << 1) - 1)

//=============================================================================
// QSPI_CFG[4:3] QSPI_DATA_FORMATE Define
#define QSPI_DATA_FORMATE_SHIFT            (3)
#define QSPI_DATA_FORMATE_MSK              ((0x01 << 2) - 1)

typedef enum
{
    QSPI_DATA_FORMATE_FLASH     = 0x00,
    QSPI_DATA_FORMATE_LCD       = 0x01,
    QSPI_DATA_FORMATE_SPARE1    = 0x02,
    QSPI_DATA_FORMATE_SPARE2    = 0x03,

} EN_QSPI_DATA_FORMATE_T;

//=============================================================================
// QSPI_CFG[2] QSPI_SDA_MODE Define
#define QSPI_SDA_MODE_SHIFT                (2)
#define QSPI_SDA_MODE_MSK                  ((0x01 << 1) - 1)

typedef enum
{
    QSPI_SDA_MODE0 = 0x00, // SI used for send data, and SO used for receieve data when SPI read mode.
    QSPI_SDA_MODE1 = 0x01, // SI used for send and receieve data when SPI read mode.

} EN_QSPI_SDA_MODE_T;

//=============================================================================
// QSPI_CFG[1:0] QSPI_CPOL_CPHA Define
#define QSPI_CPOL_CPHA_SHIFT               (0)
#define QSPI_CPOL_CPHA_MSK                 ((0x01 << 2) - 1)

typedef enum
{
    QSPI_CPHA_0_0  = 0x00,
    QSPI_CPHA_0_1  = 0x01,
    QSPI_CPHA_1_0  = 0x02,
    QSPI_CPHA_1_1  = 0x03,

} EN_QSPI_CPHA_TYPE_T;

#define IS_VALID_QSPI_CPHA(CPHA) (((CPHA) == QSPI_CPHA_0_0) || \
                                  ((CPHA) == QSPI_CPHA_0_1) || \
                                  ((CPHA) == QSPI_CPHA_1_0) || \
                                  ((CPHA) == QSPI_CPHA_1_1))


//=====================================================================================================================
// [0x30](RW)QSPI_DELAY_CFG
//=====================================================================================================================
//=============================================================================
// QSPI_DELAY_CFG[5:3] QSPI_INPUT_DELAY Define
#define QSPI_INPUT_DELAY_SHIFT             (3)
#define QSPI_INPUT_DELAY_MSK               ((0x01 << 3) - 1)
#define QSPI_INPUT_DELAY_DEFAULT           (3)

//=============================================================================
// QSPI_DELAY_CFG[2:0] QSPI_OUTPUT_DELAY Define
#define QSPI_OUTPUT_DELAY_SHIFT            (0)
#define QSPI_OUTPUT_DELAY_MSK              ((0x01 << 3) - 1)


//=====================================================================================================================
// [0x40](RW) QSPI_MEM_TX_CFG
//=====================================================================================================================
//=============================================================================
// QSPI_MEM_TX_CFG[10:6] QSPI_MEM_CMD_TYPE Define
#define QSPI_MEM_CMD_TYPE_SHIFT            (6)
#define QSPI_MEM_CMD_TYPE_MSK              ((0x01 << 5) - 1)

typedef enum
{
    TPYE_CMD            = 0x00,
    TPYE_CMD_ADDR       = 0x0C,
    TPYE_CMD_ADDR_WRITE = 0x0D,
    TPYE_CMD_ADDR_READ  = 0x0E,
    TPYE_CMD_WRITE      = 0x14,
    TPYE_CMD_READ       = 0x18,

} EN_QSPI_MEM_CMD_TYPE_T;

//=============================================================================
// QSPI_MEM_TX_CFG[5:4] QSPI_MEM_CMD_MODE Define
#define QSPI_MEM_CMD_MODE_SHIFT            (4)
#define QSPI_MEM_CMD_MODE_MSK              ((0x01 << 2) - 1)

//=============================================================================
// QSPI_MEM_TX_CFG[3:2] QSPI_MEM_ADDR_MODE Define
#define QSPI_MEM_ADDR_MODE_SHIFT           (2)
#define QSPI_MEM_ADDR_MODE_MSK             ((0x01 << 2) - 1)

//=============================================================================
// QSPI_MEM_TX_CFG[1:0] QSPI_MEM_DATA_MODE Define
#define QSPI_MEM_DATA_MODE_SHIFT           (0)
#define QSPI_MEM_DATA_MODE_MSK             ((0x01 << 2) - 1)

