EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_qspi.h
typedef enum
{
    BUS_MODE_SPI = 0x00,
    BUS_MODE_DPI = 0x02,
    BUS_MODE_QPI = 0x03,

} EN_FLASH_BUS_MODE_T;

#define IS_VALID_FLASH_BUS_MODE(MODE)   (((MODE) == BUS_MODE_SPI) || \
                                         ((MODE) == BUS_MODE_DPI) || \
                                         ((MODE) == BUS_MODE_QPI))

#define QSPI_MEM_TX_CFG_MSK                ((0x01 << 11) - 1)


//=====================================================================================================================
// [0x50](RW) QSPI_MEM_LEN_CFG
//=====================================================================================================================
//=============================================================================
// QSPI_MEM_LEN_CFG[11:6] QSPI_MEM_CMD_LEN Define
#define QSPI_MEM_CMD_LEN_SHIFT             (6)
#define QSPI_MEM_CMD_LEN_MSK               ((0x01 << 6) - 1)

//=============================================================================
// QSPI_MEM_LEN_CFG[5:0] QSPI_MEM_ADDR_LEN Define
#define QSPI_MEM_ADDR_LEN_SHIFT            (0)
#define QSPI_MEM_ADDR_LEN_MSK              ((0x01 << 6) - 1)


//=====================================================================================================================
// [0x54](RW) QSPI_FLASH_BUSY
//=====================================================================================================================
//=============================================================================
// QSPI_FLASH_BUSY[0] QSPI_FLASH_BUSY Define
#define QSPI_FLASH_BUSY_SHIFT              (0)
#define QSPI_FLASH_BUSY_MSK                ((0x01 << 1) - 1)


//=====================================================================================================================
// [0x58](RW) QSPI_FLASH_AUTO_BUSY_EN
//=====================================================================================================================
//=============================================================================
// QSPI_FLASH_AUTO_BUSY_EN[0] AUTO_BUSY_EN Define
#define AUTO_BUSY_EN_SHIFT                 (0)
#define AUTO_BUSY_EN_MSK                   ((0x01 << 1) - 1)


//=====================================================================================================================
// [0x5C](RW) QSPI_FLASH_CHECK_BUSY_INTERVAL
//=====================================================================================================================
//=============================================================================
// QSPI_FLASH_CHECK_BUSY_INTERVAL[31:12] CHECK_BUSY_INIT_PERIOD
#define CHECK_BUSY_INIT_PERIOD_SHIFT       (12)
#define CHECK_BUSY_INIT_PERIOD_MSK         ((0x01 << 20) - 1)

//=============================================================================
// QSPI_FLASH_CHECK_BUSY_INTERVAL[11:0] CHECK_BUSY_PERIOD
#define CHECK_BUSY_PERIOD_SHIFT            (0)
#define CHECK_BUSY_PERIOD_MSK              ((0x01 << 12) - 1)


//=====================================================================================================================
// [0x60](RW) QSPI_FLASH_CHECK_BUSY_CMD
//=====================================================================================================================
//=============================================================================
// QSPI_FLASH_CHECK_BUSY_CMD[9:8] CHECK_BUSY_CMD_MODE
#define CHECK_BUSY_CMD_MODE_SHIFT          (8)
#define CHECK_BUSY_CMD_MODE_MSK            ((0x01 << 2) - 1)

//=============================================================================
// QSPI_FLASH_CHECK_BUSY_CMD[7:0] CHECK_BUSY_CMD
#define CHECK_BUSY_CMD_SHIFT               (0)
#define CHECK_BUSY_CMD_MSK                 ((0x01 << 8) - 1)


//=====================================================================================================================
// [0x64](RW) QSPI_FLASH_SUSPEND_CTRL
//=====================================================================================================================
#define QSPI_FLASH_SUSPEND_CTRL_DEFAULT    (0x1eff140f)

//=============================================================================
// QSPI_FLASH_SUSPEND_CTRL[31:24] QSPI_FLASH_SUS_TPESL
#define QSPI_FLASH_SUS_TPESL_SHIFT         (24)
#define QSPI_FLASH_SUS_TPESL_MSK           ((0x01 << 8) - 1)
#define QSPI_FLASH_SUS_TPESL               (3 * 4) // 3 * 10 * 4 us = 120us

//=============================================================================
// QSPI_FLASH_SUSPEND_CTRL[23:16] QSPI_FLASH_SUS_TPEFOR
#define QSPI_FLASH_SUS_TPEFOR_SHIFT        (16)
#define QSPI_FLASH_SUS_TPEFOR_MSK          ((0x01 << 8) - 1)
#define QSPI_FLASH_SUS_TPEFOR              (50 * 4) // 50 * 10 * 4 us = 2000us

//=============================================================================
// QSPI_FLASH_SUSPEND_CTRL[15:8] QSPI_FLASH_SUS_TERS
#define QSPI_FLASH_SUS_TERS_SHIFT          (8)
#define QSPI_FLASH_SUS_TERS_MSK            ((0x01 << 8) - 1)
#define QSPI_FLASH_SUS_TERS                (2 * 4) // 2 * 10 * 4 = 80us

//=============================================================================
// QSPI_FLASH_SUSPEND_CTRL[7:0] QSPI_FLASH_SUS_UNIT_CFG
#define QSPI_FLASH_SUS_UNIT_CFG_SHIFT      (0)
#define QSPI_FLASH_SUS_UNIT_CFG_MSK        ((0x01 << 8) - 1)
#define QSPI_FLASH_SUS_UNIT_10US           (160) // 10us


//=====================================================================================================================
// [0x68](W0) QSPI_FLASH_SUSPEND_EN
//=====================================================================================================================
#define SUSPEND_EN_SHIFT                   (0)
#define SUSPEND_EN_MSK                     ((0x01 << 1) - 1)


//=====================================================================================================================
// [0x6C](WO) QSPI_FLASH_TX_EN
//=====================================================================================================================
#define QSPI_FLASH_TX_EN_SHIFT             (0)
#define QSPI_FLASH_TX_EN_MSK               ((0x01 << 1) - 1)


