EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_qspi.h
//=====================================================================================================================
// [0x70](RO) QSPI_FLASH_AUTO_BUSY_FLAG
//=====================================================================================================================
#define AUTO_BUSY_FLAG_SHIFT               (0)
#define AUTO_BUSY_FLAG_MSK                 ((0x01 << 1) - 1)


//=====================================================================================================================
// [0x80] QSPI_MEM_CACHE_CMD1
//=====================================================================================================================
#define MEM_CACHE_CMD1_DEFAULT             (0xA37A750B)

//=============================================================================
// FLASH_CACHE_CMD1[31:24] MEM_CACHE_HPM_CMD Define
#define MEM_CACHE_HPM_CMD_SHIFT            (24)
#define MEM_CACHE_HPM_CMD_MSK              ((0x01 << 8) - 1)

//=============================================================================
// FLASH_CACHE_CMD1[23:16] MEM_CACHE_RES_CMD Define
#define MEM_CACHE_RES_CMD_SHIFT            (16)
#define MEM_CACHE_RES_CMD_MSK              ((0x01 << 8) - 1)

//=============================================================================
// FLASH_CACHE_CMD1[15:8] MEM_CACHE_SUS_CMD Define
#define MEM_CACHE_SUS_CMD_SHIFT            (8)
#define MEM_CACHE_SUS_CMD_MSK              ((0x01 << 8) - 1)

//=============================================================================
// FLASH_CACHE_CMD1[7:0] MEM_CACHE_READ_CMD Define
#define MEM_CACHE_READ_CMD_SHIFT           (0)
#define MEM_CACHE_READ_CMD_MSK             ((0x01 << 8) - 1)


//=====================================================================================================================
// [0x84] QSPI_MEM_CACHE_CMD2
//=====================================================================================================================
#define MEM_CACHE_CMD2_DEFAULT             (0x0000A006)

//=============================================================================
// QSPI_MEM_CACHE_CMD2[23:16] MEM_CACHE_WRITE_CMD Define
#define MEM_CACHE_WRITE_CMD_SHIFT          (16)
#define MEM_CACHE_WRITE_CMD_MSK            ((0x01 << 8) - 1)

//=============================================================================
// QSPI_MEM_CACHE_CMD2[15:8] FLASH_CONTINUOUS_MODE Define
#define FLASH_CONTINUOUS_MODE_SHIFT        (8)
#define FLASH_CONTINUOUS_MODE_MSK          ((0x01 << 8) - 1)

//=============================================================================
// QSPI_MEM_CACHE_CMD2[7:0] FLASH_EXIT_HPM_MODE Define
#define FLASH_EXIT_HPM_MODE_SHIFT          (0)
#define FLASH_EXIT_HPM_MODE_MSK            ((0x01 << 8) - 1)


//=====================================================================================================================
// [0x88]QSPI_FLASH_CACHE_DELAY_CFG
//=====================================================================================================================
//=============================================================================
// QSPI_FLASH_CACHE_DELAY_CFG[5:0] CACHE_HPM_DELAY_MAX Define
#define CACHE_HPM_DELAY_MAX_SHIFT          (0)
#define CACHE_HPM_DELAY_MAX_MSK            ((0x01 << 6) - 1)
#define CACHE_HPM_DELAY_MAX                (0x14)

//=====================================================================================================================
// [0x8C](RW) QSPI_MEM_CACHE_CFG
//=====================================================================================================================
// QSPI_MEM_CACHE_CFG[31:28] CACHE_ADDR_DUMMY_LEN Define
#define CACHE_ADDR_DUMMY_LEN_SHIFT         (28)
#define CACHE_ADDR_DUMMY_LEN_MSK           ((0x01 << 4) - 1)

//=============================================================================
// QSPI_MEM_CACHE_CFG[27] CACHE_WRITE_EN Define
#define CACHE_WRITE_EN_SHIFT               (27)
#define CACHE_WRITE_EN_MSK                 ((0x01 << 1) - 1)

//=============================================================================
// QSPI_MEM_CACHE_CFG[26] CACHE_ADDR_MODE Define
#define CACHE_ADDR_MODE_SHIFT              (26)
#define CACHE_ADDR_MODE_MSK                ((0x01 << 1) - 1)

typedef enum
{
    CACHE_ADDR_3_BYTE = 0,
    CACHE_ADDR_4_BYTE = 1,

} EN_CACHE_ADDR_MODE_T;

//=============================================================================
// QSPI_MEM_CACHE_CFG[25:24] CACHE_CMD_BUS_MODE Define
#define CACHE_CMD_BUS_MODE_SHIFT           (24)
#define CACHE_CMD_BUS_MODE_MSK             ((0x01 << 2) - 1)

//=============================================================================
// QSPI_MEM_CACHE_CFG[23:22] CACHE_ADDR_BUS_MODE Define
#define CACHE_ADDR_BUS_MODE_SHIFT          (22)
#define CACHE_ADDR_BUS_MODE_MSK            ((0x01 << 2) - 1)

//=============================================================================
// QSPI_MEM_CACHE_CFG[21:20] CACHE_DATA_BUS_MODE Define
#define CACHE_DATA_BUS_MODE_SHIFT          (20)
#define CACHE_DATA_BUS_MODE_MSK            ((0x01 << 2) - 1)

//=============================================================================
// QSPI_MEM_CACHE_CFG[19:16] CACHE_CMD_DUMMY_LEN Define
#define CACHE_CMD_DUMMY_LEN_SHIFT          (16)
#define CACHE_CMD_DUMMY_LEN_MSK            ((0x01 << 4) - 1)
#define CACHE_CMD_DUMMY_LEN                (7)

//=============================================================================
// QSPI_MEM_CACHE_CFG[15:12] CACHE_CMD_LEN Define
#define CACHE_CMD_LEN_SHIFT                (12)
#define CACHE_CMD_LEN_MSK                  ((0x01 << 4) - 1)
#define CACHE_CMD_LEN                      (7)

//=============================================================================
// QSPI_MEM_CACHE_CFG[11:6] CACHE_ADDR_LEN Define
#define CACHE_ADDR_LEN_SHIFT               (6)
#define CACHE_ADDR_LEN_MSK                 ((0x01 << 6) - 1)
#define CACHE_ADDR_LEN                     (0x1F)
#define CACHE_DADDR_LEN                    (0x0F)
#define CACHE_QADDR_LEN                    (0x0B)

