EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_qspi.h
//=============================================================================
// QSPI_MEM_CACHE_CFG[5:0] CACHE_HPM_LEN Define
#define CACHE_HPM_LEN_SHIFT                (0)
#define CACHE_HPM_LEN_MSK                  ((0x01 << 6) - 1)
#define CACHE_HPM_LEN                      (0x1F)


//=====================================================================================================================
// [0x90](RW) FLASH_CONTINUE_READ_CFG
//=====================================================================================================================
#define FLASH_CONTINUE_READ_CFG_SHIFT      (0)
#define FLASH_CONTINUE_READ_CFG_MSK        ((0x01 << 8) - 1)
#define FLASH_CONTINUE_READ_CFG            (0xA0)


//=====================================================================================================================
// [0x94](RO) QSPI_FLASH_CONTINUE_STATUS
//=====================================================================================================================
#define QSPI_FLASH_CONTINUE_STATUS_SHIFT   (0)
#define QSPI_FLASH_CONTINUE_STATUS_MSK     ((0x01 << 1) - 1)
#define FLASH_IN_CONTINUE_READ_MODE        (QSPI_FLASH_CONTINUE_STATUS_MSK << QSPI_FLASH_CONTINUE_STATUS_SHIFT)


//=====================================================================================================================
//  STATUS Register
//=====================================================================================================================
typedef enum
{
    QSPI_DISABLE  = 0x00,
    QSPI_ENABLE   = 0x01,

} EN_QSPI_ENABLE_T;

#define IS_VALID_QSPI_ENABLE(EN)   (((EN) == QSPI_DISABLE) || ((EN) == QSPI_ENABLE))


//=====================================================================================================================
// [0xA4](RO) QSPI_MEM_STATUS
//=====================================================================================================================
#define QSPI_MEM_STATUS_SHIFT              (0)
#define QSPI_MEM_STATUS_MSK                ((0x01 << 1) - 1)
#define MEM_IN_BUSY_STATUS                 (QSPI_MEM_STATUS_MSK << QSPI_MEM_STATUS_SHIFT)


#ifdef __cplusplus
}
#endif

#endif /* __REG_QSPI_H__ */


